app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "starring", "date", "running_time", "director", "box_office", "budget", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create(movie_stats(movie_stringifier(params[:title])))

SELECT "movies".* FROM "movies" WHERE (date like '%192%')
---
  def twenties
    @twenties_movies = Movie.where('date like ?', '%192%')

SELECT "movies".* FROM "movies" WHERE (date like '%193%')
---
 def thirties
    @thirties_movies = Movie.where('date like ?', '%193%')

SELECT "movies".* FROM "movies" WHERE (date like '%194%')
---
  def forties
    @forties_movies = Movie.where('date like ?', '%194%')

SELECT "movies".* FROM "movies" WHERE (date like '%195%')
---
  def fifties
    @fifties_movies = Movie.where('date like ?', '%195%')

SELECT "movies".* FROM "movies" WHERE (date like '%196%')
---
  def sixties
    @sixties_movies = Movie.where('date like ?', '%196%')

SELECT "movies".* FROM "movies" WHERE (date like '%198%')
---
  def eighties
    @eighties_movies = Movie.where('date like ?', '%198%')

SELECT "movies".* FROM "movies" WHERE (date like '%199%')
---
  def nineties
    @nineties_movies = Movie.where('date like ?', '%199%')

SELECT "movies".* FROM "movies" WHERE (date like '%200%')
---
   def aughts
    @aughts_movies = Movie.where('date like ?', '%200%')

SELECT "movies".* FROM "movies" WHERE (date like '%201%')
---
  def twentytens
    @twentytens_movies = Movie.where('date like ?', '%201%')